In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv", nrows=6869)

In [4]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
%matplotlib inline

In [7]:
internet_df = pd.read_csv("../data/internet_use.csv", nrows=4496)

In [8]:
internet_df.head()

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN

In [4]:
internet_df.info()

NameError: name 'internet_df' is not defined

In [9]:
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4496 entries, 0 to 4495
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4496 non-null   object
 1   Year             4496 non-null   object
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), object(2)
memory usage: 140.6+ KB

In [10]:
print(internet_df.dtypes)

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [11]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6869 entries, 0 to 6868
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6869 non-null   object
 1   Year             6869 non-null   object
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 214.8+ KB

In [12]:
print(gdp_df.dtypes)

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [13]:
print(internet_df.shape)

(4496, 4)

In [14]:
print(gdp_df.shape)

(6869, 4)

In [42]:
gdp_df[-11:]

     Country or Area      Year        Value  Value Footnotes
6858        Zimbabwe      1999  3600.849291              NaN
6859        Zimbabwe      1998  3653.920016              NaN
6860        Zimbabwe      1997  3580.048793              NaN
6861        Zimbabwe      1996  3520.430146              NaN
6862        Zimbabwe      1995  3226.413930              NaN
6863        Zimbabwe      1994  3263.934978              NaN
6864        Zimbabwe      1993  3033.504852              NaN
6865        Zimbabwe      1992  3054.889178              NaN
6866        Zimbabwe      1991  3426.598094              NaN
6867        Zimbabwe      1990  3324.348171              NaN
6868   footnoteSeqID  Footnote          NaN              NaN

In [41]:
internet_df[-11:]

     Country or Area      Year     Value  Value Footnotes
4485        Zimbabwe      2002  3.994356              NaN
4486        Zimbabwe      2001  0.799846              NaN
4487        Zimbabwe      2000  0.401434              NaN
4488        Zimbabwe      1999  0.161676              NaN
4489        Zimbabwe      1998  0.081648              NaN
4490        Zimbabwe      1997  0.033080              NaN
4491        Zimbabwe      1996  0.016790              NaN
4492        Zimbabwe      1995  0.007684              NaN
4493        Zimbabwe      1994  0.001739              NaN
4494        Zimbabwe      1990  0.000000              NaN
4495   footnoteSeqID  Footnote       NaN              NaN

In [50]:
gdp_df_one = gdp_df.drop(columns = ['Value Footnotes'])
gdp_df_one

     Country or Area      Year        Value
0        Afghanistan      2019  2065.036398
1        Afghanistan      2018  2033.779002
2        Afghanistan      2017  2058.383832
3        Afghanistan      2016  2057.062164
4        Afghanistan      2015  2068.265904
...              ...       ...          ...
6864        Zimbabwe      1993  3033.504852
6865        Zimbabwe      1992  3054.889178
6866        Zimbabwe      1991  3426.598094
6867        Zimbabwe      1990  3324.348171
6868   footnoteSeqID  Footnote          NaN

[6869 rows x 3 columns]

In [51]:
internet_df_one = internet_df.drop(columns = ['Value Footnotes'])
internet_df_one

     Country or Area      Year     Value
0        Afghanistan      2014  6.390000
1        Afghanistan      2013  5.900000
2        Afghanistan      2012  5.454545
3        Afghanistan      2011  5.000000
4        Afghanistan      2010  4.000000
...              ...       ...       ...
4491        Zimbabwe      1996  0.016790
4492        Zimbabwe      1995  0.007684
4493        Zimbabwe      1994  0.001739
4494        Zimbabwe      1990  0.000000
4495   footnoteSeqID  Footnote       NaN

[4496 rows x 3 columns]

In [52]:
gdp_df_two = gdp_df_one.rename(columns = {'Country or Area':'Country','Value':'GDP_Per_Capita'})
gdp_df_two

            Country      Year  GDP_Per_Capita
0       Afghanistan      2019     2065.036398
1       Afghanistan      2018     2033.779002
2       Afghanistan      2017     2058.383832
3       Afghanistan      2016     2057.062164
4       Afghanistan      2015     2068.265904
...             ...       ...             ...
6864       Zimbabwe      1993     3033.504852
6865       Zimbabwe      1992     3054.889178
6866       Zimbabwe      1991     3426.598094
6867       Zimbabwe      1990     3324.348171
6868  footnoteSeqID  Footnote             NaN

[6869 rows x 3 columns]

In [54]:
internet_df_two = internet_df_one.rename(columns = {'Country or Area':'Country', 'Value':'Internet_Users_Pct'})
internet_df_two

            Country      Year  Internet_Users_Pct
0       Afghanistan      2014            6.390000
1       Afghanistan      2013            5.900000
2       Afghanistan      2012            5.454545
3       Afghanistan      2011            5.000000
4       Afghanistan      2010            4.000000
...             ...       ...                 ...
4491       Zimbabwe      1996            0.016790
4492       Zimbabwe      1995            0.007684
4493       Zimbabwe      1994            0.001739
4494       Zimbabwe      1990            0.000000
4495  footnoteSeqID  Footnote                 NaN

[4496 rows x 3 columns]

In [66]:
gdp_and_internet_use = pd.merge(gdp_df_two, internet_df_two, on = ['Country', 'Year'], how = 'left')
gdp_and_internet_use

            Country      Year  GDP_Per_Capita  Internet_Users_Pct
0       Afghanistan      2019     2065.036398                 NaN
1       Afghanistan      2018     2033.779002                 NaN
2       Afghanistan      2017     2058.383832                 NaN
3       Afghanistan      2016     2057.062164                 NaN
4       Afghanistan      2015     2068.265904                 NaN
...             ...       ...             ...                 ...
6864       Zimbabwe      1993     3033.504852                 NaN
6865       Zimbabwe      1992     3054.889178                 NaN
6866       Zimbabwe      1991     3426.598094                 NaN
6867       Zimbabwe      1990     3324.348171                 0.0
6868  footnoteSeqID  Footnote             NaN                 NaN

[6869 rows x 4 columns]

In [67]:
gdp_and_internet_use[5:50]

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
5   Afghanistan  2014     2102.385234            6.390000
6   Afghanistan  2013     2116.465454            5.900000
7   Afghanistan  2012     2075.491747            5.454545
8   Afghanistan  2011     1904.559799            5.000000
9   Afghanistan  2010     1957.029338            4.000000
10  Afghanistan  2009     1758.904043            3.550000
11  Afghanistan  2008     1484.114729            1.840000
12  Afghanistan  2007     1460.826075            1.900000
13  Afghanistan  2006     1315.789565            2.107124
14  Afghanistan  2005     1286.793508            1.224148
15  Afghanistan  2004     1200.278256            0.105809
16  Afghanistan  2003     1235.810063            0.087891
17  Afghanistan  2002     1189.784878            0.004561
18      Albania  2019    13724.058790                 NaN
19      Albania  2018    13366.303065                 NaN
20      Albania  2017    12811.759436                 NaN
21      Albania  2016    12331.127754                 NaN
22      Albania  2015    11916.422315                 NaN
23      Albania  2014    11623.866679           60.100000
24      Albania  2013    11397.576226           57.200000
25      Albania  2012    11263.851342           54.655959
26      Albania  2011    11088.087801           49.000000
27      Albania  2010    10783.816180           45.000000
28      Albania  2009    10346.864199           41.200000
29      Albania  2008     9944.233283           23.860000
30      Albania  2007     9179.741136           15.036115
31      Albania  2006     8596.557019            9.609991
32      Albania  2005     8066.557445            6.043891
33      Albania  2004     7604.838002            2.420388
34      Albania  2003     7177.633793            0.971900
35      Albania  2002     6776.106767            0.390081
36      Albania  2001     6462.425658            0.325798
37      Albania  2000     5911.956097            0.114097
38      Albania  1999     5492.654212            0.081437
39      Albania  1998     4834.778357            0.065027
40      Albania  1997     4414.631173            0.048594
41      Albania  1996     4924.905836            0.032197
42      Albania  1995     4486.152092            0.011169
43      Albania  1994     3934.375728                 NaN
44      Albania  1993     3610.520633                 NaN
45      Albania  1992     3275.444336                 NaN
46      Albania  1991     3507.746654                 NaN
47      Albania  1990     4842.734635            0.000000
48      Algeria  2019    11510.557088                 NaN
49      Algeria  2018    11642.194485                 NaN